# US Baby Names ðŸ‘¶

## Icebreaker

What do you think are the most common male and female names in the US since 1880 to 2014?

## Inspect the file ðŸ‘€

First, let's inspect the file using the command line. You can actually use the command line in iPython Notebook by putting "!" in front of the command. We have learned to use the command "head" to view the first 10 lines.

In [1]:
!head NationalNames.csv

Id,Name,Year,Gender,Count
1,Mary,1880,F,7065
2,Anna,1880,F,2604
3,Emma,1880,F,2003
4,Elizabeth,1880,F,1939
5,Minnie,1880,F,1746
6,Margaret,1880,F,1578
7,Ida,1880,F,1472
8,Alice,1880,F,1414
9,Bertha,1880,F,1320

Next, we can count the number of lines of the file.

In [2]:
!wc -l NationalNames.csv

 1825434 NationalNames.csv

##### Questions
1. How many lines does this text file has?
2. How many columns does this file has?
3. What is the character that separates the columns?
4. What data type is the "Count" column? "Name"?

Now, try to use the !head command to inspect a different file, "StateNames.csv" below.

In [3]:
#type your code below
!head StateNames.csv

Id,Name,Year,Gender,State,Count
1,Mary,1910,F,AK,14
2,Annie,1910,F,AK,12
3,Anna,1910,F,AK,10
4,Margaret,1910,F,AK,8
5,Helen,1910,F,AK,7
6,Elsie,1910,F,AK,6
7,Lucy,1910,F,AK,6
8,Dorothy,1910,F,AK,5
9,Mary,1911,F,AK,12

## Working with data frame ðŸ¤“

### Import pandas

In [4]:
import pandas

Pandas is a package that let us work with data table, just like Excel. Within pandas there are many functions; to call a function within panda, we have to put the prefix "panda." in front of the function. 

For example, there is a function inside panda called read_csv. This function imports a text file and converts it to a data frame. To use the function, we would type pandas.read_csv.

You might notice that it will a pain to type "pandas" every time you use a pandas' function. We can tell Python to think of "pandas" as "pd". Now you can type pd.read_csv for short.

In [5]:
import pandas as pd

### Import data

As mentioned before, read_csv is a function that can import text files. We can use that function to import the NationalNames textfile. 

There are a few things we should specify in the function. 
* Separator: As we know from inspecting the file in command line earlier, the columns are separated by commas. Thus, we specify that sep=','
* Index: The first column is the index, which just means the line numbering. In Python, column numbering starts at 0. Thus, we specify that index_col=0
* Data types: Each column would be a different data type: name would be String, year and gender would be Category, and count would be Integer (you can't have half a name...).

Lastly, we need to save the newly imported data frame to a variable to we can use it later. Let's name is "national" since it is a National Baby names data set.

In [6]:
national = pd.read_csv("NationalNames.csv",sep=',',index_col=0, 
                       dtype= {"Name":str, "Year": object, "Gender": object,"Count":int})

Now, we can apply various functions on this data frame, simply by using "national" as a prefix.

For example, to see the dimensions of the data, use the "shape" function.

In [7]:
national.shape

(1825433, 4)

Use the pd.read_csv command to import the "StateNames.csv" file into a data frame and name it "state"

In [8]:
#type your code below
state = pd.read_csv("StateNames.csv",sep=',',index_col=0, 
                       dtype= {"Name":str, "Year": object, "Gender": object, "State": object, "Count":int})

### Viewing data

Now that we have imported the data frame. We can take a look at what it looks like. Functions like "head" and "tail" let us see the first and last 5 lines, respectively.

In [9]:
national.head()

         Name  Year Gender  Count
Id
1        Mary  1880      F   7065
2        Anna  1880      F   2604
3        Emma  1880      F   2003
4   Elizabeth  1880      F   1939
5      Minnie  1880      F   1746

In [10]:
national.tail()

            Name  Year Gender  Count
Id
1825429   Zykeem  2014      M      5
1825430   Zymeer  2014      M      5
1825431  Zymiere  2014      M      5
1825432    Zyran  2014      M      5
1825433    Zyrin  2014      M      5

You can see that now the raw text file has been converted to a data frame. For each year, we have names of all the babies born in that year, and their corresponding gender and count. Now we are ready to analyze this data set.

Now try to use the head() command to view the first 5 lines the "state" data frame.

In [11]:
#type your code here
state.head()

        Name  Year Gender State  Count
Id
1       Mary  1910      F    AK     14
2      Annie  1910      F    AK     12
3       Anna  1910      F    AK     10
4   Margaret  1910      F    AK      8
5      Helen  1910      F    AK      7

### Select data

You can slice some rows out to see. For example, to see the first 5 lines:

In [12]:
national[0:5]

         Name  Year Gender  Count
Id
1        Mary  1880      F   7065
2        Anna  1880      F   2604
3        Emma  1880      F   2003
4   Elizabeth  1880      F   1939
5      Minnie  1880      F   1746

##### Question
* What's the difference between this method and the head() or tail() function?

You can select certain columns as well. For example, to see only the "Name" column:

In [13]:
national['Name']

Id
1               Mary
2               Anna
3               Emma
4          Elizabeth
5             Minnie
6           Margaret
7                Ida
8              Alice
9             Bertha
10             Sarah
11             Annie
12             Clara
13              Ella
14          Florence
15              Cora
16            Martha
17             Laura
18            Nellie
19             Grace
20            Carrie
21             Maude
22             Mabel
23            Bessie
24            Jennie
25          Gertrude
26             Julia
27            Hattie
28             Edith
29            Mattie
30              Rose
             ...
1825404      Zedrick
1825405         Zeid
1825406       Zeidan
1825407     Zekeriah
1825408        Zenas
1825409       Zephen
1825410       Zerick
1825411      Zhaiden
1825412       Zhalen
1825413      Zhayden
1825414         Ziar
1825415       Zichen
1825416        Ziden
1825417       Zierre
1825418        Ziion
1825419        Zijun
1825420        Zilas
1825421        Zirui
1825422        Zivon
1825423        Ziyah
1825424       Ziyang
1825425      Zmarion
1825426           Zo
1825427        Zyeir
1825428         Zyel
1825429       Zykeem
1825430       Zymeer
1825431      Zymiere
1825432        Zyran
1825433        Zyrin
Name: Name, dtype: object

Too see only the first 10 names:

In [14]:
national['Name'][0:10]

Id
1          Mary
2          Anna
3          Emma
4     Elizabeth
5        Minnie
6      Margaret
7           Ida
8         Alice
9        Bertha
10        Sarah
Name: Name, dtype: object

#### Boolean selection

Besides selecting the line by index, you could also choose lines that satisfy some conditions. For example, below is how to select only the female names.

First, we can make a vector called "condition" that will indicate whether a name is female or not.

In [15]:
condition = national['Gender'] == 'F'

##### Question
* What is the difference between '=' and '==' ?

What exactly is this vector? Let's inspect the first 5 lines of this vector.

In [16]:
condition.head()

Id
1    True
2    True
3    True
4    True
5    True
Name: Gender, dtype: bool

Since the first 5 names Mary, Anna, Emma, Elizabeth, and Minnie are all females name, the condition vector says "True" for all of them.

Next, we apply this condition to tell which row we would like to get. In this case, we would only get the female rows.

In [17]:
female = national[condition]

Now let's check if the code does the job.

In [18]:
female.head()

         Name  Year Gender  Count
Id
1        Mary  1880      F   7065
2        Anna  1880      F   2604
3        Emma  1880      F   2003
4   Elizabeth  1880      F   1939
5      Minnie  1880      F   1746

Can you do the same thing for male? Type your code below.

In [ ]:
#type your code below
#condition = 
#male =

### Grouping and sorting data

Each name appears many time in the table because the data lists all the baby names every year. 

What if we want to see the total occurance of a certain name from 1880 until now? 

The "groupby" function in pandas does just that. We want to group by Name to see the total count of each name. What this function does is finding identical names across all years, then collapse them to one single line, totalling the name counts every year. Let's try to do that on our female data frame, and assigning it a new name "female_byname".

In [19]:
female_byname = female.groupby('Name').sum()

Let's take a look at the new table:

In [20]:
female_byname.head()

           Count
Name
Aabha         21
Aabriella     10
Aaden          5
Aadhira       29
Aadhya       639

Notice how in grouping by name, panda automatically sort them by aphabetical order. We can also sort the names by its popularity by using the sort_values function on the column "Count".

In [21]:
female_byname_sorted = female_byname.sort_values(by='Count',ascending=False)

Now let's take a look at the 10 most popular female names from 1880 to 2014!

In [22]:
female_byname_sorted[0:10]

             Count
Name
Mary       4115282
Elizabeth  1601128
Patricia   1570567
Jennifer   1462742
Linda      1450843
Barbara    1432944
Margaret   1240006
Susan      1120469
Dorothy    1105680
Sarah      1060643

Can you do the same to get the 10 most popular male names from 1890 to 2014?

In [ ]:
#male_byname = 
#male_byname_sorted = 
#male_byname_sorted[0:10]

#### CongratulationsðŸŽ‰ðŸŽ‰ðŸŽ‰! You have done the analysis that led to this finding published on the Social Security Administration website.

https://www.ssa.gov/oact/babynames/decades/century.html

## Exercise ðŸ’€
#### Look at the "state" data frame and find the most popular male and female name in New York state in  2014.

Let's look at the state data frame. Inspect the first 10 lines.

In [ ]:
state.head()

Select only names in New York state and name it "ny"

In [ ]:
condition = state['State'] == "NY"
ny = state[condition]

Select only names of babies born in 2014 in NY state and name it "ny2014"

In [ ]:
condition = ny['Year']=='2014'
ny2014 = ny[condition]

Group by Gender to get the most popular Name of each gender in NY in 2014.

In [ ]:
ny2014.groupby('Gender').max()